# LONDON HOUSING DATASET

This dataset is primarily centered around the housing market of London. It contains a lot of additional relevant data:

• Monthly average house prices

• Yearly number of houses sold

• Monthly number of crimes committed

The data used here is from year 1995 to 2019 of each different area.

This data is available as a CSV file, downloaded from Kaggle.

We will analyze this data using the Pandas DanaFrame.

Here, random sets of quesitons are given for which we have to find correct results.

This project is for beginners and for those who want to know how we analyze big data with Python.

In [5]:
import pandas as pd 

data = pd.read_csv(r"E:\4.Python\6. Pandas project\Dataset5_London_Housing.csv")

In [6]:
data.head()

,date,area,average_price,code,houses_sold,no_of_crimes
0,1/1/1995,city of london,91449,E09000001,17.0,NaN
1,2/1/1995,city of london,82203,E09000001,7.0,NaN
2,3/1/1995,city of london,79121,E09000001,14.0,NaN
3,4/1/1995,city of london,77101,E09000001,7.0,NaN
4,5/1/1995,city of london,84409,E09000001,10.0,NaN

In [7]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13549 entries, 0 to 13548
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   date           13549 non-null  object
 1   area           13549 non-null  object
 2   average_price  13549 non-null  int64
 3   code           13549 non-null  object
 4   houses_sold    13455 non-null  float64
 5   no_of_crimes   7439 non-null   float64
dtypes: float64(2), int64(1), object(3)
memory usage: 635.2+ KB

In [8]:
data.shape

(13549, 6)

In [9]:
data.columns

Index(['date', 'area', 'average_price', 'code', 'houses_sold', 'no_of_crimes'], dtype='object')

In [15]:
data.isnull().sum()

date                0
area                0
average_price       0
code                0
houses_sold        94
no_of_crimes     6110
dtype: int64

In [16]:
data.count()

date             13549
area             13549
average_price    13549
code             13549
houses_sold      13455
no_of_crimes      7439
dtype: int64

## (A) Convert the Datatype of 'Date' column to Date-Time format.

In [ ]:
#data.dtypes
#data.date = pd.to_datetime(data.date)

In [12]:
data.head()

,date,area,average_price,code,houses_sold,no_of_crimes
0,1995-01-01,city of london,91449,E09000001,17.0,NaN
1,1995-02-01,city of london,82203,E09000001,7.0,NaN
2,1995-03-01,city of london,79121,E09000001,14.0,NaN
3,1995-04-01,city of london,77101,E09000001,7.0,NaN
4,1995-05-01,city of london,84409,E09000001,10.0,NaN

In [13]:
 
 data.date = pd.to_datetime(data.date)

In [14]:
 
 data.date

0       1995-01-01
1       1995-02-01
2       1995-03-01
3       1995-04-01
4       1995-05-01
           ...
13544   2019-09-01
13545   2019-10-01
13546   2019-11-01
13547   2019-12-01
13548   2020-01-01
Name: date, Length: 13549, dtype: datetime64[ns]

## (B.1) Add a new column "year" in the dataframe, which contains years only.

In [ ]:
# data['New_Column'] = df.Date_Column.dt.year

## (B.2) Add a new column "month" as 2nd column in the dataframe, which contains month only.

In [ ]:
# df.insert(index, 'new_column_name', new_column_values)

# data.insert (2, 'month', data.date.dt.month)

# (C) Remove the columns 'year' and 'month' from the dataframe.

# (D) Show all the records where 'No. of Crimes' is 0. And, how many such records are there?

# (E) What is the maximum & minimum 'average_price' per year in england ?

 ## (F) What is the Maximum & Minimum No. of Crimes recorded per area ?

In [ ]:
#data.groupby('area').no_of_crimes.max() 
#data.groupby('area').no_of_crimes.min().sort_values (ascending- True)

## (G) Show the total count of records of each area, where average price is less than 100000.